#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5649871c-08a6-4719-a991-61c904d103d4]
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=716ccce1-92dd-4dad-b5ca-e322987ddb70]
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=66857469-d02a-46fb-8fb5-5080e0185aaf]
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3edc4e63-88d3-4aa0-8793-3e3e969e8d04]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8afc996b-849d-4bbf-a0a3-3f6459a92d13]
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5d22047d-dab9-429b-903a-80334d6e8dd1]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fd5e656-ccf1-41de-9452-b81b3f9f3fd1]
module.keycloak_prod.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa239bf8-9eba-4a49-932b-6d935e656941]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b978cd4-a115-4c44-a1db-3c0c46bbef34]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=61182e46-69f7-48e4-9123-a416cd756b42]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f14e273-5f8e-446b-9350-093b3f75a875]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7365adae-5541-4c71-a2e2-db5f6a136c92]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ba29669-a2be-43c4-9e73-13c9b066ff39]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=583ff0c9-2c2e-4ab8-bd30-0478b5bfda23]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80124ac5-0cfb-4bdc-bb8c-bb064be97d64]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e2fff6-9d38-405c-a63b-ce0dda1ff458]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca7dec40-8a3d-4d12-8778-2e5ee1d2da31]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=583832ff-31c6-44cc-ac45-92a613fbf55b]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7c13561-3d76-4df9-8cde-4818654a47fa]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6a806dfc-9d85-43a3-ab8d-65509f7037d2]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5cb317ec-4938-488e-a976-a2b17310abb7]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bcee6b9e-fc99-436e-943e-69858a9502cd]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7fc4689-c53c-46c4-a5ce-f3a8cacb44fa]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa0006ac-75d9-4ef4-99b2-b0433c147c72]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=362d976c-2820-4f0f-a373-c520c3478342]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c41ccebc-f2d0-414b-950b-c59c802b6a75]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a200029a-e80b-49f8-a7fa-6082ad3fe89c]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=98985797-5f1f-4d5e-89c5-158053344ddd]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6282f1b9-e1a3-4944-a309-71bc7506e4b2]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f6c704d-f04f-491f-a5f1-9aac0a9d9b0b]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6a7af59a-11e1-428c-b95b-a003240adc81]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3f301a5d-2bfd-47cf-95b2-1221166820af]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae386d64-784a-4a8b-ba94-6941129e3ad3]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9498d40f-3cb2-4924-abb5-86ededda3cf3]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76a2a376-381b-440b-93c3-68ebcdd0bf71]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=20729323-b67e-4658-9978-dbf7f970220c]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2182bf1c-014e-425d-b9e6-8c40bb498a89]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf417984-89d6-4b04-8657-cf1ceaaa78c6]
module.keycloak_prod.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=351edd81-822c-4891-aef9-2a77aaf52f94]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3e224f08-e8e7-4e5d-9838-8b71ce1d1929]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=529524ab-9b37-4a10-8e5d-9c794567c455]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=31c53f1d-1fb0-4b06-b48f-0c9c9c4aaf16]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dca11070-2b8f-4a24-95f7-5de4506224f3]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ceaff0b0-8c9f-4c41-a33b-c59a05a03e0b]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa1c58fe-b390-45a2-8b80-8a547f5e1ac1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a43c3baa-e5d2-49b4-8929-d8603e7de402]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7cb63b99-0fbd-4be1-b949-be9e39c8b8cb]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb2929ff-738b-407e-8717-c13cdb5d6df4]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1b5de41d-015e-4d21-869e-b47e2644c181]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fc8bd481-284e-4433-97cf-1a2791cf4c16]
module.keycloak_prod.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cec6cf0c-cfe3-4291-93af-3555a995b136]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef729f29-c171-4a24-b577-9afcf1698904]
module.keycloak_prod.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8d54800f-f7a4-4066-bc9a-8661b4322c5e]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=08454973-aece-41fd-bd2b-4eeaa42191a7]
module.keycloak_prod.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d57b4c38-b375-450a-a2ce-855a1ceedc10]
module.keycloak_prod.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b8bd973b-911d-4a55-ab81-da0adc274bc7]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c9d0930c-f6ce-47f8-9a40-1d45f77b9c89]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ae948df4-2932-4bb8-83a5-fc9f84e47e9f]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e935485-4cf1-460f-b611-fa0147701fe9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3e160578-b8f2-4d3a-8532-ca1893c9ac3c]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de8c8e02-51e2-48f3-945a-2c0b86bec3ae]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a22dfce7-390e-4905-ba52-11bce6cfe65f]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=edd3c802-b50b-4ae1-b13a-09efc1ad38dc]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=552ed6bd-c554-4334-84c7-0a48d438c7dd]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=43fecae7-7883-4cc2-8ef3-2f7f941150de]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5835e677-1f31-41f4-93a0-1030f961940a]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73c5a213-c962-4718-8e7a-7bae222abc70]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8ce83e34-082c-441b-b833-a24a439f67f8]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aab8a048-b9d9-4067-ae21-c512b528d7ea]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fbe6482e-4bcc-4c32-88df-4933245390df]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73ee4f1d-3217-4e32-87f5-e5dda27ce9b3]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d6d6845b-d9f9-44f6-a427-47147f6344d1]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2aba48ea-ad83-437f-9a32-115347ffc4fa]
module.keycloak_prod.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9cc9674a-c23f-4d45-9d86-6d34cb7c767e]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8d72800-f179-40fa-8989-ea674bd4ba0e]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8c990c1d-afe4-47a6-857c-8cb02401ce4b]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65e2a1bb-741a-4b83-a313-892b02a074c6]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=197aece9-ca97-4c12-b299-9a58f3ddf7c5]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6e951a28-b605-41b7-ada1-4f3aa70127a0]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=83a79b0d-1adc-4a7e-a1d7-5b7514069d7f]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4957b65c-a246-4360-a54e-af73e41ae4e4]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5f181d01-3e6c-4f1a-b0f0-c0e0847b6d66]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dd63ac12-b9dd-4927-8de0-0265ef050f06]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=679ae43c-b1ff-4f7c-9eab-fe33f7400449]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4207d8-507b-4397-a0c9-2595adb3f370]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a9384df1-780e-4ef5-b8de-f3ae1650a027]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=487ca7bf-51f5-4f7a-b597-b5b787511949]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62c33ff0-61c5-478f-bcff-60cc6b08bf46]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c381275-dcdd-4bac-857d-f7e90a7b6b04]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6c596cc-08f6-4991-904d-7799362900a6]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=af90f0fc-8d1f-4b4e-997d-979a95703555]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d82ffd30-d281-4077-8bca-cb05d8dc37a7]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8bb345e7-6e26-4ebd-89c4-094fcaa2c684]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=625a2b5c-ec5b-4f25-ac04-c423053083bf]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfe3d10d-5cab-4b23-8970-8fa455b5a231]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f52e9756-581b-40bd-8f77-a66c3a695407]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d1ecd95e-f8f4-44b7-8188-dfce9342285b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=155959da-6fbe-47cf-87bb-4e3dda3c5f5b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=606e17b3-be4f-4cab-8a4d-b70d1a60d0b9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jan-31-test-team-role-edit-2-4820"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jan-31-test-team-role-edit-2-4820"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-2-4820.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "jan-31-test-team-role-edit-2-4820"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jan-31-test-team-role-edit-2-4820"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
      + web_origins                              = [
          + "+",
          + "https:///www.test.ca/devChange",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jan-31-test-team-role-edit-3-4821"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jan-31-test-team-role-edit-3-4821"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jan-31-test-team-role-edit-3-4821.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "jan-31-test-team-role-edit-3-4821"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jan-31-test-team-role-edit-3-4821"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
      + web_origins                              = [
          + "+",
          + "https:///www.test.ca/devChange",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3375 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*